// Источник: homework 9.txt
// Задание 1:
// Создать проект в котором : 
// 1. создать три файла: ( function.h , function.cpp , prog.cpp ) 
// 2. в файле function.cpp необходимо написать следующие функции для работы с массивом данных:
// а) функцию для заполнения массива случайными значениями ; 
// б) функцию для вывода значений массива на консоль ; 
// в) функцию для поиска минимального элемента; 
// г) функцию для поиска максимального элемента; 
// д) функцию для сортировки ; 
// е) функцию для редактирования значения массива.
// Данные функции необходимо написать для работы с массивом целых, действительных и символьных значений. 
// (Для каждого типа написать отдельную функцию) . 
// 3. в файле function.h нужно: 
// а) описать прототипы всех функций; 
// б) сделать проверку определена ли константа, указывающая на тип данных ( #ifdef INTEGER ) 
// в) создать обобщающие имена функции , которым будет определена функция соответствующего типа в зависимости от константы , 
// указанной в файле prog.cpp . (# define show ShowInt ) 
// 4. в файле prog.cpp нужно : 
// а) в функции main вызвать все функции через переозначеные( обобщенные ) имена из файла function.h ( show ( )) 
// б) определить константу , которая указывает какой тип данных будет использоваться . Например INTEGER - целые данные, CHAR - символьные DOUBLE - настоящие. 
// (# define INTEGER ) Имя функциям нужно давать так , чтобы они отвечали своей сути . 
// Например функция для вывода значений массива целых чисел на консоль - ShowArrayInt ().
// А, когда переопределяем функцию с помощью # define то нужно давать общее имя. Например # define ShowArray ShowArrayInt

#include <iostream>
#include <conio.h>
#include <Windows.h>
#include <ctime>

using namespace std;

#define INTEGER
#include "function.h"

void main()
{
	srand(unsigned(time(0)));
	setlocale(0, "");
	cout << "Введите размер массива: ";
	int n;
	cin >> n;
	Type* mas = (Type*)malloc(n * sizeof(Type));
	char ch;
	int s, s1;
	do
	{
		system("cls");
		cout << "1 - Заполнение массива случайными значениями\n" <<
			"2 - Вывод значений массива на консоль\n" <<
			"3 - Поиск минимального элемента\n" <<
			"4 - Поиск максимального элемента\n" <<
			"5 - Сортировка\n" <<
			"6 - Редактирование значения массива\n"<<
			"Esc - Выход";
		ch = _getch();
		switch (ch)
		{
		case '1':system("cls");
			Rand(mas, n);
			break;
		case '2':system("cls");
			Print(mas, n);
			Sleep(4000);
			break;
		case '3':system("cls");
			Min(mas, n);
			Sleep(2000); 
			break;
		case '4':system("cls");
			Max(mas, n);
			Sleep(2000);
			break;
		case '5':system("cls");
			cout << "1 - Сортировать от меньшего числа\n" <<
				"2 - Сортировать от большего числа\n";
			cin >> s;
			Sort(mas, n, s);
			break;
		case '6':system("cls");
			cout << "Какое значение изменить (от 1 до " << n <<") ?\n";
			cin >> s1;
			Edit(mas, s1);
			break;
		}
	} while (ch != 27);
	free(mas);
}
