// Источник: HM OOP 2.txt
// Задание 2.
// Разработать класс Reservoir (водоем). Класс должен обяза-
// тельно иметь поле «название». Класс должен содержать:
// конструктор по умолчанию, конструктор с параметрами,
// при необходимости реализовать деструктор и конструк-
// тор копирования.
// Добавить методы для:
// 1. Определения приблизительного объема (ширина*
// длина*максимальная глубина);
// 2. Определения площади водной поверхности;
// 3. Метод для проверки относятся ли водоемы к одному
// типу (море-море; бассейн-пруд);
// 4. Для сравнения площади водной поверхности водоемов
// одного типа;
// 5. Для копирования объектов;
// 6. Остальные методы на усмотрение разработчика (ме-
// тоды set и get).
// Написать интерфейс для работы с классом. Реализовать
// динамический массив объектов класса с возможностью
// добавления, удаления объектов из массива.

#include <Windows.h>
#include <conio.h>
#include "Reservoir.h"
#define clr system("cls")

int main()
{
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
	Reservoir a;
	char ch, ch2;
	int k, l;
	//buffer
	int b, u, f;
	char t;
	char* name = new char[100];
	//
	do
	{
		clr;
		cout << "1 - Добавить водоём\n" <<
			"2 - Удалить водоём\n" <<
			"3 - Определить объем\n" <<
			"4 - Определить площадь\n" <<
			"5 - Проверить тип двух водоёмов\n" <<
			"6 - Сравнить площадь водоёмов\n" <<
			"7 - Скопировать информацию о водоёме\n" <<
			"8 - Вывести на экран список\n"
			"Esc - Выход\n";
		ch = _getch();
		switch (ch)
		{
		case '1':clr;
			a.New();
			clr;
			cout << "Добавлено";
			Sleep(1000);
			break;
		case '2':clr;
				a.Delete();
				Sleep(1000);
				break;
		case '3':clr;
			cout << "Введите номер в списке: \n";
			cin >> k;
			a.CalV(k);
			Sleep(2000);
				break;
		case '4':clr;
			cout << "Введите номер в списке: \n";
			cin >> k;
			a.CalS(k);
			Sleep(2000);
				break;
		case '5':clr;
			cout << "Введите номера водоёмов в списке: \n";
			cin >> k >> l;
			a.CheckT(k, l);
			Sleep(2000);
				break;
		case '6':clr;
				cout << "Введите номера водоёмов в списке: \n";
				cin >> k >> l;
				a.CheckST(k, l);
				Sleep(2000);
				break;
		case '7':clr;
				cout << "Введите номер водоёма для копирования: \n";
				cin >> k;
				a.Copy(k, name, b, u, f, t);
				cout << "Вывести копию на экран (д/н)?";
				ch2 = _getch();
				if (ch2 == 'д') {
					cout << "\nНазвание - " << name << "\nШирина - " << b <<
						"\nДлина - " << u << "\nГлубина - " << f <<
						"\nТип - " << t;
				}
				Sleep(2000);
				break;
		case '8':clr;
				a.Print();
				Sleep(3000);
				break;
		}
	} while (ch != 27);
	delete[]name;
}

