// Источник: HM OOP 1.txt
// Задание 2.
// Создайте приложение «Телефонная книга». Необходимо
// хранить данные об абоненте (ФИО, домашний телефон,
// рабочий телефон, мобильный телефон, дополнительная
// информация о контакте) внутри соответствующего класса.
// Наполните класс переменными-членами, функциями-
// членами, конструкторами, inline-функциями-членами,
// используйте инициализаторы, реализуйте деструктор.
// Обязательно необходимо выделять динамически память под
// ФИО. Предоставьте пользователю возможность добавлять
// новых абонентов, удалять абонентов, искать абонентов
// по ФИО, показывать всех абонентов.


#include <Windows.h>
#include <conio.h>
#include "TelBook.h"
#define clr system("cls")
int main()
{
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);
    TelBook a("Телефонная книга");
    char ch;
    do {
        clr;
        cout << "1 - Добавить абонента в книгу\n" <<
            "2 - Удалить абонента\n" <<
            "3 - Найти абонента\n" <<
            "4 - Вывести весь список\n" <<
            "Esc - Выход\n";
        ch = _getch();
        switch (ch)
        {
        case '1':clr;
            a.Add();
            Sleep(1000);
            clr;
            cout << "Добавлено";
            Sleep(1000);
            break;
        case '2':clr;
            a.Del();
            clr;
            cout << "Удалено";
            Sleep(1000);
            break;
        case '3':clr;
            a.Find();
            Sleep(3500);
            break;
        case '4':clr;
            a.print();
            Sleep(4500);
            break;
        }
    } while (ch != 27);
}
