// Источник: Urok 1.txt
// 1.Цифровой счетчик, это переменная с ограниченным
// диапазоном. Значение которой сбрасывается, когда
// ее целочисленное значение достигает определен-
// ного максимума (например, k принимает значения
// в диапазоне от 0..100). В качестве примера такого
// счетчика можно привести цифровые часы, счетчик
// километража. Опишите класс такого счетчика. Обе-
// спечьте возможность установления максимального
// и минимального значений, увеличения счетчика на
// 1, возвращения текущего значения.

#include "Clock.h"
int main()
{
	setlocale(0, "");
	char ch;
	short a, b, c, d, e, f;
	do {
		clr;
		cout << "\t\tЧтобы остановить часы нажмите любую клавишу\n\n";
		cout << "1 - Запуск часов с нуля\n" <<
			"2 - Установить таймер\n" <<
			"3 - Установить начало и конец отсчёта\n" <<
			"4 - Установить время и запустить часы\n" <<
			"Esc - выход\n";
		ch = _getch();
		if (ch == '1')
		{
			clr;
			Clock g;
			g.show1();
		}
		else if (ch == '2')
		{
			clr;
			cout << "Ч - "; cin >> a;
			cout << "М - "; cin >> b;
			cout << "С - "; cin >> c;
			Clock g(a,b,c);
			g.show2();
		}
		else if (ch == '3')
		{
			clr;
			cout << "Начало: \n";
			cout << "Ч - "; cin >> a;
			cout << "М - "; cin >> b;
			cout << "С - "; cin >> c;
			cout << "\nКонец: \n";
			cout << "Ч - "; cin >> d;
			cout << "М - "; cin >> e;
			cout << "С - "; cin >> f;
			Clock g(a, b, c, d, e, f);
			g.show2();
		}
		else if (ch == '4')
		{
			clr;
			cout << "Ч - "; cin >> a;
			Clock g(a);
			g.show1();
		}
	} while (ch != 27);
}

