// Источник: HM OOP 4.txt
// Задание 1.
// В ранее созданный класс String добавьте перегрузку [], (),
// преобразования типа к int
// * [] — возвращает элемент по указанному индексу;
// * () — ищет символ в строке, если символ есть воз-
// вращает индекс, если нет -1.
// Преобразование к int возвращает длину строки
// Реализуйте операцию инкеремента. Она должна увели-
// чивать длину строки на единицу. Новый символ запол-
// няется пробелом.
// Реализуйте операцию декремента. Она должна уменьшать
// длину строки на единицу.

#include <Windows.h>
#include "String.h"
#define clr system("cls")

int main()
{
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
	String a(10);
	a.Enter();
	a.Show();
	int b = 4;
	char c = a.operator[](b);
	cout << "\n" << c;
	char ch = 'б';
	int v = a.operator()(ch);
	cout << "\n" << v << endl;
	a--;
	a.Show();
	cout << endl;
	a++;
	a.Show();
	cout << endl;
	int k = a.operator-();
	cout << k;
}

