// Источник: HM OOP 2.txt
// Задание 3.
// Разработать класс String, который в дальнейшем будет
// использоваться для работы со строками. Класс должен
// содержать:
// • Конструктор по умолчанию, позволяющий создать
// строку длиной 80 символов;
// • Конструктор, позволяющий создавать строку произ-
// вольного размера;
// • Конструктор, который создаёт строку и инициализи-
// рует её строкой, полученной от пользователя.
// • Необходимо создать деструктор, а также использовать
// механизмы делегирования конструкторов, если это
// возможно.
// • Класс должен содержать методы для ввода строк с кла-
// виатуры и вывода строк на экран.

#include <Windows.h>
#include <conio.h>
#include "String.h"
#define clr system("cls")

int main()
{
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
	char ch, ch1;
	do
	{
		clr;
		cout << "1 - Ввести строку на 80 элементов\n" <<
			"2 - Ввести строку произвольного размера\n" <<
			"3 - Ввести строку и сохранить её в буфере обмена\n" <<
			"Esc - выход\n";
		ch = _getch();
		if (ch == '1') {
			clr;
			String a;
			a.Enter();
			clr;
			cout << "Вывести строку на экран (д/н)?";
			ch1 = _getch();
			if (ch1 == 'д')
			{
				clr;
				a.Show();
			}
			Sleep(2000);
		}
		else if (ch == '2') {
			clr;
			int k;
			cout << "Введите размер строки: ";
			cin >> k;
			cin.ignore();
			String a(k);
			a.Enter();
			clr;
			cout << "Вывести строку на экран (д/н)?";
			ch1 = _getch();
			if (ch1 == 'д')
			{
				clr;
				a.Show();
			}
			Sleep(2000);
		}
		else if (ch == '3') {
			clr;
			cout << "Введите строку\n";
			char str[200];
			gets_s(str, 200);
			String a(str);
			clr;
			cout << "Вывести строку на экран (д/н)?";
			ch1 = _getch();
			if (ch1 == 'д')
			{
				clr;
				a.Show();
			}
			Sleep(2000);
		}

	} while (ch != 27);
}
