// Источник: HM OOP 2.txt
// Задание 1.
// Создайте программу, имитирующую многоквартирный
// дом. Необходимо иметь классы «Человек», «Квартира»,
// «Дом». Класс «Квартира» содержит динамический массив
// объектов класса «Человек». Класс «Дом» содержит массив
// объектов класса «Квартира».
// Каждый из классов содержит переменные-члены и функ-
// ции-члены, которые необходимы для предметной области
// класса. Обращаем ваше внимание, что память под стро-
// ковые значения выделяется динамически. Например, для
// ФИО в классе «Человек». Не забывайте обеспечить классы
// различными конструкторами (конструктор копирования
// обязателен), деструкторами. В main протестировать ра-
// боту полученного набора классов.

#include <Windows.h>
#include <conio.h>
#include "House.h"
#define clr system("cls")
int main()
{
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
	House a(30);
	char ch;
	do
	{
		clr;
		cout << "1 - Заселение в квартиру\n" <<
			"2 - Выселение с квартиры\n" <<
			"3 - Поиск жильца\n" <<
			"4 - Вывести список жильцов в квартире\n" <<
			"5 - Вывести информацию о доме\n" <<
			"Esc - Выход\n";
		ch = _getch();
		switch (ch)
		{
		case '1':clr;
			a.Add();
			Sleep(2000);
			break;
		case '2':clr;
			a.Del();
			Sleep(1500);
			break;
		case '3':clr;
			a.Find();
			Sleep(3000);
			break;
		case '4':clr;
			a.ShowAp();
			Sleep(4000);
			break;
		case '5':clr;
			a.Show();
			system("pause");
			break;
		}
	} while (ch != 27);
}

